[
  {
    "id": "toi_124850215",
    "source_url": "https://timesofindia.indiatimes.com/sports/cricket/news/record-prithvi-shaw-creates-history-in-ranji-trophy-becomes-fastest-batter-in-21st-century-to-/articleshow/124850215.cms",
    "full_text": "Prithvi Shaw (Photo by Charle Lombard/Gallo Images/Getty Images)\nPrithvi Shaw\nhas set a new record in his second official match for Maharashtra in a\nRanji Trophy\nmatch against Chandigarh. The 25-year-old achieved a remarkable feat that puts him in the company of cricket legends\nVirender Sehwag\nand Ravi Shastri.\nShaw demonstrated his determination to return to the Indian team with an impressive century for Maharashtra during their second match of the 2025-26 Ranji Trophy season. The game was played at the Sector 16 Cricket Stadium in Chandigarh.\nAfter a modest score of eight runs in the first innings, Shaw delivered an extraordinary performance in the second innings. He scored 222 runs from 156 balls, including 29 boundaries and five sixes, maintaining a strike rate of 142.31.\nIndia vs Australia: Virat Kohli & Rohit Sharma rewrite history at SCG\nShaw's batting prowess was evident as he reached his century in 73 balls and completed his double century in 141 deliveries.\nThe Maharashtra batter now holds the record for the fastest double century in Ranji Trophy's elite competition in the 21st century. He surpassed his own previous record of 174 balls, set against Baroda in 2019/20 at the Reliance Stadium in Vadodara.\nIn the 91-year history of India's premier first-class competition, only Ravi Shastri's innings in 1984 for Bombay against Baroda was faster.\nShastri's memorable knock included becoming the first Indian to hit six sixes in an over.\nShaw currently holds two positions among the four fastest double centuries in the first division of India's premier first-class competition. Only Shastri and Shaw have managed to score double centuries in fewer than 150 balls in Ranji Trophy's elite group.\nIncluding players from the plate division, Tanmay Agarwal's performance stands out.\nThe Hyderabad batsman recorded the third-fastest double century in first-class cricket history during the 2023-24 season against Arunachal Pradesh in Secundarabad.\nShaw joins Virender Sehwag as the second Indian to score multiple double hundreds in first-class cricket in under 200 balls. Sehwag accomplished this feat three times, sharing the world record with Graeme Hick.\nThere are only eight players globally who have achieved multiple double centuries in fewer than 200 balls. Twenty other Indian players have scored double centuries at a run-a-ball pace, including notable cricketers like Shastri, Rohit Sharma, Yuvraj Singh, Sachin Tendulkar, Sarfaraz Khan, and\nShreyas Iyer\n.\nSehwag remains unique for achieving this feat three times in Test cricket, a record unmatched by any other Indian player. Only three other international players - Nathan Astle, Ben Stokes, and Brendon McCullum - have managed this achievement in Test cricket.\nThe fastest double centuries in Ranji Trophy Elite Group matches have been recorded as follows: Ravi Shastri (123 balls) for Bombay against Baroda in 1984/85 at Mumbai's Wankhede Stadium; Prithvi Shaw (141 balls) for Maharashtra against Chandigarh in 2025-26 at Chandigarh; Rajesh Bora (156 balls) for Assam against\nBihar\nin 1991-92 at Ranchi; and Prithvi Shaw (174 balls) for Mumbai against Baroda in 2019-20 at Vadodara.\nCatch Lovlina Borgohain's inspiring story on Game On, Episode 5. Watch Here",
    "image_url": "https://static.toiimg.com/thumb/msid-124850437,imgsize-61754,width-400,resizemode-4/2nd-four-day-tour-match-south-africa-a-v-india-a-day-4.jpg"
  },
  {
    "id": "toi_124852280",
    "source_url": "https://timesofindia.indiatimes.com/sports/nba/top-stories/is-lebron-james-playing-tonight-vs-portland-trail-blazers-latest-update-on-the-los-angeles-lakers-stars-injury-report-october-27-2025/articleshow/124852280.cms",
    "full_text": "LeBron James. Image via: Adam Pantozzi/ NBAE via Getty Images\nLeBron James will not be suiting up for the Los Angeles Lakers\ntonight against the Portland Trail Blazers, as he continues to recover from a sciatic nerve injury. The update, confirmed in the Lakers’ latest injury report for October 27, 2025, highlights the growing concern within the franchise about the health of their 40-year-old superstar.\nHis absence leaves a noticeable void in both leadership and versatility - two traits the team desperately needs against a surging Blazers squad.\nLeBron James’ Sciatica Injury Update vs Portland Trail Blazers (October 27, 2025)\nLeBron James remains sidelined due to sciatica, a nerve condition that has kept him off the court since the start of the 2025–26 NBA season. The issue originated during offseason workouts in late July and has persisted despite ongoing treatment. Sciatica typically causes sharp pain, numbness, or tingling sensations that extend from the lower back through the leg - symptoms particularly concerning for an athlete who relies heavily on power, balance, and explosiveness.\nThe Los Angeles Lakers’ medical staff continues to manage LeBron’s recovery carefully, emphasizing long-term health over short-term results. While there is optimism around his progress, the team has avoided providing an exact return date. However, internal discussions suggest early November could be a realistic goal if his rehabilitation continues smoothly.\nHow LeBron James’ Absence Affects the Los Angeles Lakers\nWithout LeBron James, the Los Angeles Lakers are entering tonight’s contest severely undermanned.\nThe team will also be missing Luka Doncic, Maxi Kleber, and Adou Thiero, all dealing with their own injury setbacks. With so many key players unavailable, Los Angeles will look to Austin Reaves and Marcus Smart to shoulder the scoring and playmaking responsibilities. Rui Hachimura and Deandre Ayton are expected to anchor the frontcourt, providing much-needed size and energy against Portland’s defensive schemes.\nThe absence of star power undoubtedly raises questions about the team’s offensive rhythm and defensive stability. Fans and analysts alike are curious to see how head coach Darvin Ham adjusts his rotations to compensate for the missing leadership on the floor.\nLeBron James’ Impact from the Sideline\nEven when not playing, LeBron’s influence remains significant. Expect him to be a vocal presence on the bench - mentoring young players, offering strategic advice, and keeping team morale high.\nHis sideline appearances often add an extra spark to the atmosphere, as fans enjoy seeing his animated reactions, lighthearted moments with teammates, and interactions with courtside supporters. For a player often described as the face of modern basketball, even his presence in street clothes commands attention.\nLeBron’s absence underscores the Los Angeles Lakers’ ongoing reliance on his leadership and all-around playmaking ability.\nHistorically, the team’s performance takes a noticeable dip when he’s unavailable - a reminder of just how vital he remains, even in his 23rd NBA season. His recovery timeline will continue to be closely monitored, with hopes that he’ll rejoin the lineup in time to help Los Angeles regain momentum and solidify playoff aspirations.\nFor now, the Los Angeles Lakers must navigate a challenging stretch without their cornerstone player. Tonight’s matchup against the Trail Blazers offers a chance for the younger core to prove themselves, stepping up in the absence of their leader. The King’s throne may be empty for the moment, but anticipation is already building for his eventual - and undoubtedly dramatic - return to the court.\nCatch Lovlina Borgohain's inspiring story on Game On, Episode 5. Watch Here",
    "image_url": "https://static.toiimg.com/thumb/msid-124852284,imgsize-37868,width-400,resizemode-4/lebron-james.jpg"
  },
  {
    "id": "toi_124824468",
    "source_url": "https://timesofindia.indiatimes.com/technology/tech-news/general-motors-lays-off-hundreds-of-engineers-on-microsoft-teams-says-its-not-your-performance-its/articleshow/124824468.cms",
    "full_text": "General Motors has laid off more than 200 salaried employees, primarily Computer-Aided Design (CAD) engineers, as part of its ongoing restructuring efforts to boost profitability.\nThe cuts, which took place Friday at the company's global tech campus in Warren, Michigan, come just days after the Detroit automaker raised its 2025 financial guidance following strong third-quarter earnings.\nThe affected employees were notified via Microsoft Teams calls Friday morning that their positions were being eliminated due to \"business conditions\" rather than performance issues, according to company sources.\nGM confirmed the layoffs were part of a broader reorganisation of its design engineering division.\nGM's restructuring aims to strengthen core design capabilities\n\"We're restructuring our design engineering team to strengthen our core architectural design engineering capabilities,\" GM stated. \"As a result, a number of CAD execution roles have been eliminated. We recognize the efforts and accomplishments of the impacted team members, and we thank them for their contributions.\"\nBloomberg first reported the layoffs, which represent a continuation of GM's white-collar workforce reductions. The automaker's US salaried headcount has decreased from 53,000 in 2023 to 50,000 by the end of last year as the company regularly reviews its operations to eliminate positions deemed unnecessary for future operations.\nLayoffs follow automaker’s strong earnings performance\nThe timing of the cuts is notable, occurring just three days after GM posted robust third-quarter results that sent its stock surging 15%—the company's second-best single-day performance since emerging from bankruptcy in 2009.\nGM shares have climbed more than 29% this year, hitting new 52-week highs.\nThe automaker also raised its profit outlook, citing reduced tariff pressure and diminished electric vehicle losses. However, GM has faced significant challenges, including $1.1 billion in tariff-related profit cuts and $1.6 billion in charges from scaling back its EV plans.\nGM isn't alone in downsizing. Electric vehicle maker Rivian announced last week it would cut roughly 600 jobs—4.5% of its workforce—as the automotive industry grapples with policy changes and slower-than-expected EV demand following the expiration of the $7,500 federal EV tax credit.\nSatya Nadella Steps Back to Focus on AI: Microsoft’s Major Reorganisation Explained",
    "image_url": "https://static.toiimg.com/thumb/msid-124824440,imgsize-131632,width-400,resizemode-4/file-gm.jpg"
  },
  {
    "id": "toi_118107365",
    "source_url": "https://timesofindia.indiatimes.com/spotlight/harness-the-future-of-technology-with-ai-and-ml-mastery-from-this-programme-by-iitm-pravartak/articleshow/118107365.cms",
    "full_text": "Are you ready to step into the future of AI and ML? This is a question that many professionals are asking themselves today as organisations are actively restructuring their DNA with AI.\nToday, this technology is at the forefront of change and driving a technological renaissance, redefining how humanity approaches its greatest challenges. Organisations are either hiring experts in the domain or are pushing their employees to upskill because the AI of today already has the capability to:\nSlash redundant effort across processes\nOffer complex solutions tailored to specific business needs\nHelp multiply employee productivity\nEven execute processes end-to-end without any manual intervention\nBelieve it or not, organisations are aware that they need to pivot towards higher AI-consciousness to stay competitive.\nAs NASSCOM and BCG forecast, India's AI market is on a meteoric rise, expected to reach $17 billion by 2027, becoming a key driver of economic growth and innovation.\n1\nBut, India still faces a 51% demand-supply gap in AI and ML professionals, with a demand of over 629,000 specialists but a supply of only 416,000.\n2\nThis gap presents a tremendous opportunity with 10x more projected jobs and 4x more higher salaries available to those who upskill in AI and ML.\nRecognising this demand, Emeritus and IITM Pravartak (the technological hub of IIT Madras) have launched the\nAdvanced Certificate Programme in Applied Artificial Intelligence and Machine Learning.\nThis programme is tailored for professionals eager to leverage cutting-edge technologies to drive innovation and tackle complex problems. This unique programme offers participants a competitive edge in the industry, featuring rigorous instruction from distinguished IIT faculty and globally renowned AI and ML experts.\nThe faculty lineup includes Professor C. Chandra Sekhar, former Head of the CSE Department at IIT Madras (2019–22), and Professor Dileep A.D.\n, Professor at IIT Dharwad and a research scholar at IIT Madras. These award-winning educators have published numerous research papers in prestigious international journals, making them ideal mentors for this transformative journey. The programme further combines IIT faculty teachings with live sessions led by domain experts, delving into real-world applications and tools.\nParticipants will also engage in hands-on labs designed to cultivate practical expertise, ensuring that they graduate as well-rounded AI and ML professionals ready to meet the demands of this rapidly growing field.\nProgramme highlights: Transform your  AI and ML J\nourney with IITM\nPravartak\nThe Advanced Certificate Programme in Applied Artificial Intelligence and Machine Learning is thoughtfully designed to combine academic brilliance, industry insights, and hands-on learning to prepare you for a thriving career in the AI and ML domain.\nWith distinguished IIT faculty, a practical curriculum, and global certifications, this programme ensures a seamless blend of theoretical understanding and practical application.\nHere’s what makes it stand out:\nComprehensive curriculum backed by domain e\nxperts\nWith access to 25+ tools and Gen AI libraries taught in cutting-edge virtual integrated labs, and a curriculum designed for real-world application, the programme ensures you gain practical, job-ready skills.\nWeekly live sessions by domain experts further enhance your learning with insights into the latest tools and practices.\nPrestigious Certifications from IITM Pravartak\nand IBM\nStand out with\na certification from IITM Pravartak.\nThese globally respected credentials not only validate your expertise but also significantly enhance your professional credibility. The programme also offers\nthree IBM Certifications\nand access to IBM masterclasses led by industry leaders. Focus areas include:\n• Deep Learning with TensorFlow\n• Building Your Own Chatbot\n• PyTorch: Tensor, Dataset, and Data Augmentation\nAffordable and high-value education\nCombining premium instruction with cost-effectiveness, this programme provides a long-term return on investment.\nWith up to 4x higher earning potential, the affordability of this course makes it accessible for learners aiming to gain cutting-edge AI and ML skills without breaking the bank.\nA flexible and engaging learning experience\nLearn at your own pace with pre-recorded videos designed for flexibility while engaging with interactive live sessions. This blended learning approach ensures you gain deep knowledge while balancing work and personal commitments.\nReal-world applications through projects and cases\nGet hands-on experience solving over 30 real-world projects and cases and participate in a two-week capstone project to showcase your expertise in practical applications of AI and ML.\nExclusive Agentic AI masterclasses for advanced learning\nLearn about agent lifecycle, different strategies, core components, and tools using which you can build and deploy your own intelligent agents that can execute real-world tasks.\nGo through different case studies, learn about responsible AI, and map out future trends.\nBuild your digital brand on GitHub and collaborate on Kaggle\nStrengthen your professional presence by creating a robust portfolio on platforms like GitHub and Kaggle, demonstrating your skills and projects to potential employers.\nOptional immersion at IIT Madras Research Park\nEngage with the innovative ecosystem of IITM Pravartakthrough an optional\ntwo-day campus immersion at the IIT Madras Research Park.\nInteract with faculty, explore cutting-edge research, and experience a world-class technological hub.\nCareer advancement with Emeritus support\nLeverage Emeritus’ career services, including placement assistance, resume-building workshops, and industry connections, to unlock unparalleled career opportunities in the AI and ML domain.\nWho will benefit from this programme?\nThe Advanced Certificate Programme in Applied Artificial Intelligence and Machine Learning by IITM Pravartak is thoughtfully designed to cater to a diverse range of professionals.\nWhether you are a technical expert eager to advance your skills or a business leader striving to understand the transformative power of AI, this programme equips you with the knowledge and tools to excel in the rapidly evolving world of AI and ML.\nWith its blend of theoretical depth and practical insights, this programme is perfect for:\n•\nData Scientists and Data Analysts\nElevate your career by mastering cutting-edge AI and ML techniques.\nThis programme helps you refine your expertise in tools and methodologies that power advanced analytics and predictive modeling.\n•\nSoftware Engineers:\nWhether transitioning into AI/ML roles or integrating AI capabilities into existing projects, software professionals will gain a robust foundation in machine learning algorithms and real-world applications.\n•\nBusiness Analysts and Consultants:\nMove beyond conventional analysis—learn to harness AI to drive strategic, data-backed decision-making, enabling smarter recommendations and improved outcomes for clients and stakeholders.\n•\nProduct Managers and Product Owners:\nExpand your toolkit by integrating AI and ML into product development. Understand how to design, develop, and manage AI-driven solutions that meet user needs and boost product performance.\nBy the end of the Advanced Certificate Programme in Applied AI and ML, here’s what you’ll be equipped to do:\n1. Lead AI/ML Initiatives\nTake charge of AI and ML projects from concept to execution.\nYou'll be equipped to drive innovation and solve complex business challenges by applying AI techniques to real-world problems, delivering actionable solutions that accelerate growth and transformation.\n2. Make Data-Driven Decisions\nGain the ability to extract valuable insights from vast datasets. Whether in operations, marketing, or strategy, you’ll learn to leverage AI to make informed, data-driven decisions that improve business outcomes and optimise performance.\n3. Collaborate with AI/ML Teams\nBecome proficient in speaking the language of data scientists and engineers. By bridging the gap between business and technical teams, you’ll be able to effectively communicate requirements, align objectives, and execute AI initiatives seamlessly.\n4. Stay Ahead of the Curve\nThe AI and ML landscape is constantly evolving. With this programme, you’ll stay updated on the latest advancements and emerging trends, ensuring that you are always at the forefront of the industry and prepared to implement cutting-edge technologies.\nProgramme details: Key information at a glance\n•\nProgramme Start Date\n: 12th November 2025\n•\nDuration\n: 11 Months\n•\nWeekly Commitment\n: 9-10 hours/week (additional effort may be required for non-technical students)\n•\nProgramme Fee\n: ₹1,59,900 + GST\n•\nFormat\n: Online, live interactive sessions\n(Enrol today to get an early bird discount of ₹7,995)\nAs the technological landscape rapidly evolves, AI and ML are driving innovation across industries.\nBy enrolling in the Advanced Certificate Programme in Applied Artificial Intelligence and Machine Learning from IITM Pravartak, you are setting yourself up for success in one of the most dynamic and high-demand fields.\nWith guidance from IIT's esteemed faculty, hands-on training with the latest tools, and the opportunity to earn industry-recognised certifications, you’ll be equipped to lead AI/ML initiatives, make data-driven decisions, and collaborate effectively with technical teams.\nIf you are looking to gain a competitive edge in the AI and ML market and future-proof your career, this is your opportunity to get started.\nClick here\nto enrol and unlock new opportunities with AI and ML expertise from IIT Madras.\nReferences:\n1.\nhttps://nasscom.in/knowledge-center/publications/state-data-science-ai-skills-india-data-and-art-smart-intelligence\n2.\nhttps://www.ibm.com/think/insights/ai-upskilling\nDisclaimer: This article has been produced on behalf of Emeritus by Times Internet’s Spotlight team",
    "image_url": "https://static.toiimg.com/thumb/msid-123759347,imgsize-1520694,width-838,resizemode-4/123759347.jpg"
  },
  {
    "id": "toi_124846696",
    "source_url": "https://timesofindia.indiatimes.com/toi-plus/international/will-taliban-unleash-water-war-on-pak-the-way-india-did-post-pahalgam/articleshow/124846696.cms",
    "full_text": "Every parent’s dream of giving their child not just a good education, but the right environment to grow, explore, and discover their potential. For over two decades, the\nGlobal Indian International School (GIIS)\nhas been that nurturing ground for thousands of young learners.\nWith care at its core and excellence as its compass, GIIS has steadily built a reputation as Asia’s unrivalled IB school—one that balances ambition with empathy, and success with well-being.\nGIIS is ranked Singapore’s\n#1 IB school in 2025\n, reflecting its consistent excellence with an IBDP average score of 37.4 in the May session for cohorts of 100 students or more. With over 18 years of IB legacy, the school has produced 125+ world toppers and near-perfect scorers—a testament to the dedication of its students and teachers.\nYet beyond the numbers, what truly stands out is how GIIS shapes confident, compassionate individuals who go on to join leading universities such as Oxford, Cambridge, Brown, Columbia, Cornell, UC Berkeley, and NUS.\nTo date, more than 400 students have been placed in top universities, including Ivy League and Oxbridge.\nAt GIIS, education is more than a pathway to university—it is preparation for life. Families can choose the route that best fits their child’s journey: an all-through international curriculum beginning with IB Early Years and Primary Years Program, progressing through Cambridge in middle school, and culminating in the IB Diploma, or the CBSE pathway that anchors students in India’s national curriculum while providing global exposure.\nWhat Sets GIIS Apart\nExperienced educators:\nOver 60% of teachers bring more than a decade of expertise, including IB-trained educators and examiners.\nHolistic 9GEMS framework:\nAn award-winning framework for holistic development that integrates academics, leadership, sports, arts, innovation, and community service.\nModern campuses:\nThe SMART Campus at Punggol and the East Coast campus feature digital classrooms, Apple smart screens, and over 60 specialized studios, including a radio studio, TV studio, and culinary lab.\nStrong career guidance:\nThe Career Counselling and University Guidance (CCUG) team works with students from Grade 8 onwards to chart pathways to their dream careers and universities.\nWell-being focus:\nPastoral care, peer buddy systems, and tracking of happiness alongside academic progress.\nVoices from the GIIS Community\n“GIIS gave me the confidence and support to aim high. With my teachers’ and university placement team’s guidance, I secured admission at Imperial College, London. The environment at GIIS is both challenging and nurturing.” – IB Year 2025 Graduate\n“The school made the transition smooth for my child. The focus on well-being and academics is balanced, and the 9GEMS approach has helped him grow beyond the classroom.” – Parent of a Grade 9 Student\n“GIIS provided me with skill sets to navigate the academic & professional world. I am grateful for the support and guidance given to me throughout my schooling years. The teaching and inspiration enabled me to trust myself and achieve the highest standards.” GIIS Alumni working at McKinsey & Company, London\nA Global Vision\nAs part of the\nGlobal Schools Group (GSG)\nnetwork of 64 campuses in 11 countries,\nGSG\nprovides a \"global passport\" of opportunities to over 45,000 students. This blend of international exposure and individual care has created generations of learners who not only excel academically but also carry with them the values of empathy, resilience, and leadership. This network facilitates global access to resources, an exchange of ideas and cultures, and seamless transfers across campuses.\nIn Singapore, the Global Indian International School (GIIS) has long been a preferred choice for expatriate families, both within and beyond the Indian community. With a strong legacy of academic excellence, GIIS has received over 600 awards from prestigious international educational bodies—testament to its commitment to innovation and quality education.\nGIIS also holds the singular distinction of being the\nonly K–12 international school in Singapore\nto be awarded the prestigious\nEdutrust Star\n—a recognition granted to institutions demonstrating outstanding standards in management, education delivery, and student support.\nAt GIIS, education goes beyond academic achievement. It focuses on nurturing well-rounded individuals who are as capable in the classroom as they are in the wider world. This holistic approach is exactly what today’s global workplaces and societies demand—and its what parents value most about a GIIS education.\nDiscover more about GIIS by\nvisiting our website\nor\nreaching out to the GIIS team\n.\nDisclaimer: Content Produced by GLOBAL INDIAN INTERNATIONAL SCHOOL",
    "image_url": null
  },
  {
    "id": "toi_124843945",
    "source_url": "https://timesofindia.indiatimes.com/toi-plus/business-economy/indias-ipo-market-is-booming-but-are-retail-investors-benefiting/articleshow/124843945.cms",
    "full_text": "Image used for representative purpose only\nNEW DELHI: A 21-year-old woman, her ex-boyfriend and his friend have been arrested for allegedly killing her live-in partner, a UPSC aspirant, in north Delhi's Timarpur earlier this month and staging it as a fire incident.\nAccording to police, she planned the murder as she suspected he possessed a hard disk containing \"objectionable\" videos and photographs of her.\nBengaluru Doctor Arrested For Allegedly Killing Wife With Anesthesia Overdose Months After Wedding\nYou Can Also Check:\nDelhi AQI\n|\nWeather in Delhi\n|\nGold Rate Today in Delhi\n|\nSilver Rate Today in Delhi\nThe accused - Amrita Chauhan, her ex-boyfriend Sumit Kashyap (27) and his friend Sandeep Kumar (29) - hail from UP's Moradabad, where they were nabbed.\nOn Oct 6, police were alerted to a fire on a fourth-floor flat in Gandhi Vihar. Firefighters found a charred body inside, later identified as 32-year-old Ramkesh Meena.\nA case under sections related to causing death by negligence was registered at the time.\nHow footage from CCTV cam foiled bid to pass off murder as fire accident\nCCTV footage showed two masked persons entering the building on the day of the incident. After 39 minutes, one person could be seen exiting, and at 2.57am, a woman with another individual left the premises. The fire broke out shortly afterward, raising suspicion.\nAccording to sources, the woman's identity was established and her phone's location found near the site of the incident. When police tried to contact her, it was switched off. Several raids in Moradabad led to her arrest on Oct 18. Cops said she confessed to the crime and revealed the involvement of Kashyap and Kumar as well as the motive. Police recovered the hard disk, a trolley bag and the victim's shirt.\nKashyap and Kumar were subsequently arrested on Oct 22 and 23, respectively.\nPolice later invoked BNS sections related to murder, common intention, and mischief by injury, inundation, fire or explosive substance against the trio.\nPolice said an inquiry revealed Chauhan and Meena, who met in May this year, had a live-in relationship. \"She claimed he secretly recorded obscene videos and refused to delete them,\" an officer said.\nWhen she shared her grievance with Kashyap, he allegedly roped in his friend to retrieve the hard disk.\nChauhan, a BSc Forensic Science student and an avid watcher of crime series, hatched the plan to murder Meena and make it seem as though he died in a fire, police said.\nThe trio allegedly thrashed and strangled Meena, before pouring oil, ghee and wine over his body. Kashyap placed a gas cylinder near the victim's head, opened the regulator and ignited it with a lighter while Chauhan secured the flat's iron gate from the inside, said police. They allegedly stole the hard disk, two laptops and other items belonging to Meena. About an hour later, the cylinder exploded, completely burning the victim.\nConfirming the arrests, DCP (North) Raja Banthia said Kashyap worked as an LPG distributor while Kumar was a graduate preparing for SSC CGL exams.",
    "image_url": "https://static.toiimg.com/thumb/msid-124838301,imgsize-1149385,width-400,height-225,resizemode-72/image-used-for-representative-purpose-only.jpg"
  },
  {
    "id": "toi_124845316",
    "source_url": "https://timesofindia.indiatimes.com/toi-plus/politics/the-minorities-commission-has-failed-minorities-is-it-time-to-scrap-it/articleshow/124845316.cms",
    "full_text": "File photo\nNEW DELHI: After the EC announced a pan-India SIR, including West Bengal, the Mamata Banerjee government went for one of the biggest one-day shake-up transferring over 500 bureaucrats.\nThough dated October 24, the transfer orders were uploaded in phases on the department’s website both before and after the Election Commission announced the SIR.\nTransfer orders for 61 IAS and 145 WBCS (Executive) officers were uploaded in the first half of the day, followed by postings of six IAS and 315 WBCS officers appearing online soon after the EC’s briefing.\nThe officers will serve as key functionaries in the SIR exercise, and once the schedule is notified, any further transfers by the state would require EC approval, PTI reported citing an official.\nThe SIR will run from November 4 to December 4, with draft electoral rolls slated for release on December 9 and the final list set to be published on February 7.\n'CM Mamata sensing trouble': BJP; TMC hits back\nThe Bharatiya Janata Party (BJP) questioned the timing of the transfers calling the \"last-minute bulk transfers\" an effort to \"disturb the process (SIR)\".\n\"CM Mamata Banerjee is sensing trouble for her party once this exercise is successfully completed and a large number of fake voters are deleted from the electoral rolls.\nShe is, hence, trying everything in her hand to disturb the process by making such last-minute bulk transfers,\" BJP leader Sajal Ghosh alleged.\nTMC rubbished the allegations saying it was a \"routine measure\". \"Such transfers take place in the government as a routine measure across the year. There's no reason why one should draw a connection between this and the SIR announcement. This is opposition for opposition's sake,\" TMC IT cell head Debangshu Bhattacharya said.\nKey transfers\nAmong those shifted were 14 district magistrates, several special secretaries, OSDs, and a large number of ADMs and SDOs across both IAS and WBCS cadres. HIDCO MD Shashank Sethi has taken charge as DM of North 24 Parganas, with Murshidabad DM Rajarshi Mitra moving to his position. KMC commissioner Dhaval Jain has been posted as DM of Birbhum, while Sumit Gupta from South 24 Parganas replaces him. Haldia Development Authority CEO Kontam Sudhir has been appointed DM of Purulia.\nScience and technology department secretary Godala Kiran Kumar will now serve as divisional commissioner of Medinipur, and Panchayat & rural development special secretary Kuhuk Bhushan has been named DM of Kalimpong. New DMs have also been assigned to Cooch Behar, Murshidabad, Darjeeling, Malda, Jhargram, Purba and Paschim Medinipur, Hooghly, and Dakshin Dinajpur.",
    "image_url": "https://static.toiimg.com/thumb/msid-124852726,imgsize-1094229,width-400,resizemode-4/-.jpg"
  }
]